extends Node

var wordInfo:Dictionary = {}

var data_file_path = "res://Data/Vocabulary/VocabData.json"

var kwords = [
	"개", "고양이", "물고기", "새", "소", "쥐", "말", "동물", "배", "머리", "목", "얼굴", "턱수염", "머리카락", "눈", "입", "입술", "코", "이빨", "귀", "눈물", "혀", "등", "허리", "발가락", "손가락", "발", "손", "팔", "어깨", "심장", "피", "뇌", "무릅", "땀", "병", "뼈", "목소리", "피부", "몸", "모자", "드레스", "양복", "치마", "티셔츠", "바지", "신발", "주머니", "코트", "얼룩", "옷", "빨간색", "초록색", "파랑색", "노랑색", "곤색", "분홍색", "갈색", "오랜지색", "검은색", "하얀색", "회색", "색깔", "월요일", "화요일", "수요일", "목요일", "금요일", "토요일", "일요일", "선생님", "학생", "변호사", "의사", "환자", "웨이터", "비서", "신부님", "경찰", "군대", "군인", "예술가", "저자", "매니저", "기자", "배우", "직업", "일월", "이월", "삼월", "사월", "오월", "유월", "칠월", "팔월", "구월", "시월", "십일월", "십이월", "바다", "강", "산", "비", "눈", "달", "세계", "지구", "숲", "하늘", "식물", "바람", "토양", "꽃", "계곡", "뿌리", "호수", "별", "잔디", "나뭇잎", "공기", "모래", "해변", "파도", "불", "어름", "섬", "언덕", "열", "자연", "하나", "둘", "셋", "넷", "다섯", "여섯", "일곱", "여덟", "아홉", "열", "열하나", "열둘", "열셋", "열넷", "열다섯", "열여섯", "열일곱", "열여덟", "열아홉", "스물", "스물한", "스물두", "서른", "서른하나", "서른둘", "마흔", "마흔하나", "마흔둘", "쉰", "쉰하나", "쉰둘", "예순", "예순하나", "예순둘", "여든", "여든하나", "여든둘", "아흔", "아흔하나", "아흔둘", "아들", "딸", "엄마", "아빠", "부모님", "애기", "남자", "여자", "형", "누나", "오빠", "언니", "할아버지", "할머니", "남편", "아내", "스포츠", "경주", "운동", "공", "게임", "기차", "비행기", "차", "트럭", "자정거", "버스", "선박", "엔진", "길", "도로", "공항", "기차역", "날개", "타이어", "기름", "기차표", "교통", "도시", "집", "다리", "호텔", "식당", "농장", "재판소", "학교", "사무실", "방", "마을", "대학교", "클럽", "술집", "공원", "캠프", "가게", "극장", "도서관", "병원", "교회", "시장", "나라", "건물", "바닥", "공간", "은행", "위치", "왕", "여왕", "대통령", "옆집 사람", "여자아이", "남자아이", "성인", "인간", "친구", "피해자", "선수", "팬", "군중", "사람", "종교", "천국", "지옥", "죽음", "약", "돈", "원", "지폐", "결혼", "결혼식", "팀", "인종", "섹스", "성별", "살인", "교도소", "기술", "정력", "전쟁", "평화", "공격", "선거", "잡지", "신문", "독", "총", "가격", "계약서", "마약", "간판", "과학", "하느님", "밴드", "노래", "악기", "음악", "영화", "미술", "커피", "차", "맥주", "쥬스", "물", "우유", "음료수", "계란", "치즈", "국물", "케이크", "닭", "돼지고기", "소고기", "사과", "바나나", "오렌지", "레몬", "옥수수", "쌀", "밥", "식용유", "씨", "칼", "숟가락", "포크", "접시", "컵", "아침", "점심", "저녁", "설탕", "소금", "병", "음식", "책상", "탁자", "식탁", "의자", "침대", "꿈", "창문", "문", "침실", "부엌", "화장실", "연필", "볼펜", "사진", "비누", "책", "페이지", "열쇠", "페인트", "편지", "메모", "벽", "종이", "천장", "지붕", "수영장", "자물쇠", "전화기", "정원", "마당", "바늘", "가방", "상자", "선물", "카드", "반지", "도구", "시계", "램프", "휴대폰", "네트워크", "컴퓨터", "노트북", "화면", "카메라", "텔레비전", "라디오", "유리", "금속", "플라스틱", "나무", "돌", "다이아몬드", "찰흙", "먼지", "금", "구리", "은", "재료", "미터", "센티미터", "킬로미터", "반", "서클", "정사각형", "온도", "날짜", "무게", "가장자리", "지도", "점", "자음", "모음", "가벼운", "소리", "네", "아니요", "조각", "아픔", "상처", "구멍", "이미지", "패턴", "명사", "동사", "형용사", "위에", "아래", "옆면", "뒷면", "안에", "밖에", "왼쪽", "오른쪽", "곧장", "북쪽", "남쪽", "동쪽", "서쪽", "방향", "여름", "봄", "겨울", "가을", "계절", "공", "백", "백하나", "백둘", "백십", "백십일", "천", "천일", "만", "십만", "백만", "천만", "억", "십억", "첫번째", "둘째", "세번째", "네번째", "다섯번째", "번호", "년", "달", "시간", "분", "밤", "일하다", "놀다", "걷다", "뛰다", "운전하다", "날다", "수영하다", "가다", "멈추다", "따르다", "생각하다", "말하다", "먹다", "마시다", "죽이다", "죽다", "웃다", "울다", "사다", "지불하다", "팔다", "쏘다", "배우다", "점프하다", "냄새를 맡다", "듣다", "맛보다", "보다", "만지다", "뽀뽀하다", "불타다", "녹다", "파다", "폭발하다", "앉다", "서다", "사랑하다", "지나가다", "자르다", "싸우다", "눕다", "춤추다", "자다", "깨다", "노래하다", "세다", "결혼하다", "기도하다", "이기다", "지다", "섞다", "구부리다", "씻다", "요리하다", "열다", "닫다", "쓰다", "부르다", "돌다", "건설하다", "가르치다", "자라다", "그리다", "먹이다", "잡다", "던지다", "청소하다", "찾다", "넘어지다", "밀다", "당기다", "들다", "망가지다", "깨지다", "입다", "흔들다", "서명하다", "패다", "들어올리다", "길다", "짧다", "키가 크다", "키가 작다", "넓다", "크다", "작다", "느리다", "빠르다", "뜨겁다", "차겁다", "따뜻하다", "선선하다", "새롭다", "오래되다", "젊다", "늙다", "좋다", "나쁘다", "젖다", "건조하다", "아프다", "건강하다", "시끄럽다", "조용하다", "행복하다", "슬프다", "아름답다", "못생기다", "귀머거리", "맹인", "착하다", "가난하다", "부유하다", "두껍다", "얇다", "비싸다", "싸다", "평탄하다", "구부러지다", "끼다", "헐렁하다", "놉다", "낮다", "딱딱하다", "부드럽다", "깊다", "얕다", "깨끗하다", "더럽다", "힘이 세다", "약하다", "살다", "무겁다", "가볍다", "어둡다", "밝다", "인기가 많다", "저", "나", "그", "우리", "상대방", "저의", "내", "당신", "내가", "네가", "너희들"
]
var unique_syllables = ["개", "고", "양", "이", "물", "기", "새", "소", "쥐", "말", "동", "배", "머", "리", "목", "얼", "굴", "턱", "수", "염", "카", "락", "눈", "입", "술", "코", "빨", "귀", "혀", "등", "허", "발", "가", "손", "팔", "어", "깨", "심", "장", "피", "뇌", "무", "릅", "땀", "병", "뼈", "부", "몸", "모", "자", "드", "레", "스", "복", "치", "마", "티", "셔", "츠", "바", "지", "신", "주", "니", "트", "룩", "옷", "간", "색", "초", "록", "파", "랑", "노", "곤", "분", "홍", "갈", "오", "랜", "검", "은", "하", "얀", "회", "깔", "월", "요", "일", "화", "금", "토", "선", "생", "님", "학", "변", "호", "사", "의", "환", "웨", "터", "비", "서", "경", "찰", "군", "대", "인", "예", "저", "매", "우", "직", "업", "삼", "유", "칠", "구", "시", "십", "다", "강", "산", "달", "세", "계", "숲", "늘", "식", "람", "꽃", "곡", "뿌", "별", "잔", "디", "나", "뭇", "잎", "공", "래", "해", "도", "불", "름", "섬", "언", "덕", "열", "연", "둘", "셋", "넷", "섯", "여", "곱", "덟", "아", "홉", "한", "두", "른", "흔", "쉰", "순", "든", "들", "딸", "엄", "빠", "애", "남", "형", "누", "할", "버", "편", "내", "포", "운", "게", "임", "차", "행", "럭", "정", "거", "박", "엔", "진", "길", "로", "항", "역", "날", "타", "표", "교", "통", "집", "텔", "당", "농", "재", "판", "실", "방", "을", "클", "럽", "원", "캠", "프", "극", "관", "라", "건", "닥", "위", "왕", "령", "옆", " ", "성", "친", "팬", "중", "종", "천", "국", "옥", "죽", "음", "약", "돈", "폐", "결", "혼", "팀", "섹", "살", "력", "전", "쟁", "평", "격", "잡", "문", "독", "총", "과", "느", "밴", "악", "영", "미", "커", "맥", "쥬", "료", "란", "즈", "케", "크", "닭", "돼", "렌", "몬", "쌀", "밥", "용", "씨", "칼", "숟", "접", "컵", "침", "점", "녁", "설", "탕", "책", "상", "탁", "꿈", "창", "엌", "필", "볼", "펜", "페", "쇠", "메", "벽", "붕", "반", "램", "휴", "폰", "네", "워", "컴", "퓨", "북", "면", "속", "플", "틱", "돌", "흙", "먼", "센", "킬", "각", "온", "짜", "벼", "조", "픔", "처", "멍", "패", "턴", "명", "에", "뒷", "안", "밖", "왼", "쪽", "곧", "향", "봄", "겨", "울", "절", "백", "만", "억", "첫", "번", "째", "년", "밤", "놀", "걷", "뛰", "멈", "추", "따", "르", "먹", "웃", "쏘", "냄", "를", "맡", "듣", "맛", "보", "뽀", "녹", "폭", "앉", "싸", "눕", "춤", "섞", "씻", "닫", "쓰", "그", "던", "청", "찾", "넘", "밀", "망", "올", "짧", "키", "작", "넓", "뜨", "겁", "뜻", "롭", "되", "젊", "늙", "좋", "쁘", "젖", "끄", "슬", "답", "못", "맹", "착", "난", "껍", "얇", "탄", "러", "끼", "헐", "렁", "놉", "낮", "딱", "깊", "얕", "끗", "더", "힘", "볍", "둡", "밝", "많", "너", "희"]


func _ready():
	wordInfo = loadJsonFile(data_file_path)
	#print(wordInfo["dog"])

func loadJsonFile(filePath: String):
	if FileAccess.file_exists(filePath):
		var dataFile = FileAccess.open(filePath, FileAccess.READ)
		var parsedResult = JSON.parse_string(dataFile.get_as_text())
		
		if parsedResult is Dictionary:
			return parsedResult
		else:
			print("Error reading file")
	else:
		print("File does not exist")

# This function will break any word into syllables
func break_into_syllables(word: String) -> Array:
	var result = []
	for i in range(word.length()):
		result.append(word.substr(i, 1)) # Extract each character as a syllable
	#print(result)
	return result

func getWordInfo(word: String) -> Dictionary:
	return wordInfo.get(word, {})

func getEntry(word: String):
	#print("trying to get english word for ", word)
	for key in wordInfo.keys():
		var entry = wordInfo[key]
		#print("the current entry kword is ", entry["kword"])
		if entry["kword"] == word:
			return entry
			#print("get english word ", entry)
	return null
